
## Plan Result (test_gameserver)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 12 to add, 2 to change, 9 to destroy.</code></pre>

* Create
  * azurerm_network_security_group.this[&#34;private&#34;]
  * azurerm_network_security_group.this[&#34;public&#34;]
  * azurerm_network_security_rule.this[&#34;DenyAll&#34;]
  * azurerm_subnet.this[&#34;private&#34;]
  * azurerm_subnet.this[&#34;public&#34;]
  * azurerm_subnet_network_security_group_association.this[&#34;private&#34;]
  * azurerm_subnet_network_security_group_association.this[&#34;public&#34;]
* Update
  * azurerm_resource_group.game_server
  * azurerm_virtual_network.this
* Delete
  * azurerm_network_security_group.this
  * azurerm_network_security_rule.this[&#34;Allow80&#34;]
  * azurerm_subnet.this
  * azurerm_subnet_network_security_group_association.this
* Replace
  * azurerm_network_security_rule.this[&#34;Allow2022&#34;]
  * azurerm_network_security_rule.this[&#34;Allow22&#34;]
  * azurerm_network_security_rule.this[&#34;Allow443&#34;]
  * azurerm_network_security_rule.this[&#34;Allow8080&#34;]
  * azurerm_network_security_rule.this[&#34;AllowGameServerPorts&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_network_security_group.this will be destroyed
  # (because resource uses count or for_each)
  - resource "azurerm_network_security_group" "this" {
      - id                  = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-test-rg/providers/Microsoft.Network/networkSecurityGroups/games-test-nsg" -> null
      - location            = "uksouth" -> null
      - name                = "games-test-nsg" -> null
      - resource_group_name = "games-test-rg" -> null
      - security_rule       = [
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "2022"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Allow2022"
              - priority                                   = 1040
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "5.68.117.12"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "22"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Allow22"
              - priority                                   = 1010
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "5.68.117.12"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "27000-27100"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowGameServerPorts"
              - priority                                   = 1050
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "443"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Allow443"
              - priority                                   = 1020
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "5.68.117.12"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "80"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Allow80"
              - priority                                   = 1000
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "8080"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Allow8080"
              - priority                                   = 1030
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "5.68.117.12"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - tags                = {
          - "application" = "gameservers"
          - "environment" = "test"
        } -> null
    }

  # azurerm_network_security_group.this["private"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "games-test-private-nsg"
      + resource_group_name = "games-test-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "application" = "game_servers"
          + "environment" = "test"
        }
    }

  # azurerm_network_security_group.this["public"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "games-test-public-nsg"
      + resource_group_name = "games-test-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "application" = "game_servers"
          + "environment" = "test"
        }
    }

  # azurerm_network_security_rule.this["Allow2022"] must be replaced
-/+ resource "azurerm_network_security_rule" "this" {
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_ranges                    = [] -> null
      ~ id                                         = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-test-rg/providers/Microsoft.Network/networkSecurityGroups/games-test-nsg/securityRules/Allow2022" -> (known after apply)
        name                                       = "Allow2022"
      ~ network_security_group_name                = "games-test-nsg" -> "games-test-public-nsg" # forces replacement
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_ranges                         = [] -> null
        # (10 unchanged attributes hidden)
    }

  # azurerm_network_security_rule.this["Allow22"] must be replaced
-/+ resource "azurerm_network_security_rule" "this" {
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_ranges                    = [] -> null
      ~ id                                         = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-test-rg/providers/Microsoft.Network/networkSecurityGroups/games-test-nsg/securityRules/Allow22" -> (known after apply)
        name                                       = "Allow22"
      ~ network_security_group_name                = "games-test-nsg" -> "games-test-public-nsg" # forces replacement
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_ranges                         = [] -> null
        # (10 unchanged attributes hidden)
    }

  # azurerm_network_security_rule.this["Allow443"] must be replaced
-/+ resource "azurerm_network_security_rule" "this" {
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_ranges                    = [] -> null
      ~ id                                         = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-test-rg/providers/Microsoft.Network/networkSecurityGroups/games-test-nsg/securityRules/Allow443" -> (known after apply)
        name                                       = "Allow443"
      ~ network_security_group_name                = "games-test-nsg" -> "games-test-public-nsg" # forces replacement
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_ranges                         = [] -> null
        # (10 unchanged attributes hidden)
    }

  # azurerm_network_security_rule.this["Allow80"] will be destroyed
  # (because key ["Allow80"] is not in for_each map)
  - resource "azurerm_network_security_rule" "this" {
      - access                                     = "Allow" -> null
      - destination_address_prefix                 = "*" -> null
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_range                     = "80" -> null
      - destination_port_ranges                    = [] -> null
      - direction                                  = "Inbound" -> null
      - id                                         = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-test-rg/providers/Microsoft.Network/networkSecurityGroups/games-test-nsg/securityRules/Allow80" -> null
      - name                                       = "Allow80" -> null
      - network_security_group_name                = "games-test-nsg" -> null
      - priority                                   = 1000 -> null
      - protocol                                   = "Tcp" -> null
      - resource_group_name                        = "games-test-rg" -> null
      - source_address_prefix                      = "*" -> null
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_range                          = "*" -> null
      - source_port_ranges                         = [] -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_network_security_rule.this["Allow8080"] must be replaced
-/+ resource "azurerm_network_security_rule" "this" {
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_ranges                    = [] -> null
      ~ id                                         = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-test-rg/providers/Microsoft.Network/networkSecurityGroups/games-test-nsg/securityRules/Allow8080" -> (known after apply)
        name                                       = "Allow8080"
      ~ network_security_group_name                = "games-test-nsg" -> "games-test-public-nsg" # forces replacement
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_ranges                         = [] -> null
        # (10 unchanged attributes hidden)
    }

  # azurerm_network_security_rule.this["AllowGameServerPorts"] must be replaced
-/+ resource "azurerm_network_security_rule" "this" {
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      ~ destination_port_range                     = (sensitive value)
      - destination_port_ranges                    = [] -> null
      ~ id                                         = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-test-rg/providers/Microsoft.Network/networkSecurityGroups/games-test-nsg/securityRules/AllowGameServerPorts" -> (known after apply)
        name                                       = "AllowGameServerPorts"
      ~ network_security_group_name                = "games-test-nsg" -> "games-test-public-nsg" # forces replacement
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ source_address_prefix                      = (sensitive value)
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_ranges                         = [] -> null
        # (8 unchanged attributes hidden)
    }

  # azurerm_network_security_rule.this["DenyAll"] will be created
  + resource "azurerm_network_security_rule" "this" {
      + access                      = "Deny"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAll"
      + network_security_group_name = "games-test-public-nsg"
      + priority                    = 4096
      + protocol                    = "*"
      + resource_group_name         = "games-test-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_resource_group.game_server will be updated in-place
  ~ resource "azurerm_resource_group" "game_server" {
        id         = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-test-rg"
        name       = "games-test-rg"
      ~ tags       = {
          ~ "application" = "gameservers" -> "game_servers"
            "environment" = "test"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_subnet.this will be destroyed
  # (because resource uses count or for_each)
  - resource "azurerm_subnet" "this" {
      - address_prefixes                              = [
          - "10.151.191.0/24",
        ] -> null
      - default_outbound_access_enabled               = true -> null
      - id                                            = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-test-rg/providers/Microsoft.Network/virtualNetworks/games-test-vnet/subnets/games-test-subnet" -> null
      - name                                          = "games-test-subnet" -> null
      - private_endpoint_network_policies             = "Disabled" -> null
      - private_link_service_network_policies_enabled = true -> null
      - resource_group_name                           = "games-test-rg" -> null
      - service_endpoint_policy_ids                   = [] -> null
      - service_endpoints                             = [] -> null
      - virtual_network_name                          = "games-test-vnet" -> null
    }

  # azurerm_subnet.this["private"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.151.191.0/25",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "games-test-private-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "games-test-rg"
      + virtual_network_name                          = "games-test-vnet"
    }

  # azurerm_subnet.this["public"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.151.191.128/25",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "games-test-public-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "games-test-rg"
      + virtual_network_name                          = "games-test-vnet"
    }

  # azurerm_subnet_network_security_group_association.this will be destroyed
  # (because resource uses count or for_each)
  - resource "azurerm_subnet_network_security_group_association" "this" {
      - id                        = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-test-rg/providers/Microsoft.Network/virtualNetworks/games-test-vnet/subnets/games-test-subnet" -> null
      - network_security_group_id = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-test-rg/providers/Microsoft.Network/networkSecurityGroups/games-test-nsg" -> null
      - subnet_id                 = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-test-rg/providers/Microsoft.Network/virtualNetworks/games-test-vnet/subnets/games-test-subnet" -> null
    }

  # azurerm_subnet_network_security_group_association.this["private"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.this["public"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.this will be updated in-place
  ~ resource "azurerm_virtual_network" "this" {
        id                             = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-test-rg/providers/Microsoft.Network/virtualNetworks/games-test-vnet"
        name                           = "games-test-vnet"
      ~ tags                           = {
          ~ "application" = "gameservers" -> "game_servers"
            "environment" = "test"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 12 to add, 2 to change, 9 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":461,"Program":"tfcmt","SHA1":"","Target":"test_gameserver","Vars":{}} -->